## Staging: eks
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.notification-canada-ca-waf-logs will be created
  + resource "aws_cloudwatch_log_group" "notification-canada-ca-waf-logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "aws-waf-logs-notification-canada-ca-waf"
      + retention_in_days = 7
      + tags              = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
      + tags_all          = {
          + "CostCenter" = "notification-canada-ca-staging"
        }
    }

  # aws_wafv2_web_acl_logging_configuration.notification-canada-ca-waf-logs will be created
  + resource "aws_wafv2_web_acl_logging_configuration" "notification-canada-ca-waf-logs" {
      + id                      = (known after apply)
      + log_destination_configs = (known after apply)
      + resource_arn            = "arn:aws:wafv2:ca-central-1:239043911459:regional/webacl/notification-canada-ca-waf/d7f2eabc-ee4e-4c8d-b262-97f5370b5555"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>